In [98]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [228]:
data = pd.read_csv("../DataSets/titanic_1.csv")
data.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [229]:
data_cleaned = data[["Sex","Age", "Fare", "Pclass", "Survived"]]

In [230]:
data_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Sex       891 non-null    object
 1   Age       714 non-null    float64
 2   Fare      891 non-null    float64
 3   Pclass    891 non-null    int64
 4   Survived  891 non-null    int64
dtypes: float64(2), int64(2), object(1)
memory usage: 34.9+ KB

In [231]:
data_cleaned.isna().sum()

Sex           0
Age         177
Fare          0
Pclass        0
Survived      0
dtype: int64

In [232]:
data_cleaned.Age = data_cleaned.Age.fillna(data_cleaned.Age.mean())
data_cleaned.Fare = data_cleaned.Fare.fillna(data_cleaned.Fare.mean())

C:\Users\vijay\anaconda3\lib\site-packages\pandas\core\generic.py:5516: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [233]:
data_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Sex       891 non-null    object
 1   Age       891 non-null    float64
 2   Fare      891 non-null    float64
 3   Pclass    891 non-null    int64
 4   Survived  891 non-null    int64
dtypes: float64(2), int64(2), object(1)
memory usage: 34.9+ KB

In [234]:
dummy_sex = pd.get_dummies(data_cleaned.Sex)
dummy_sex

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

In [235]:
data_cleaned = pd.concat([data_cleaned, dummy_sex], axis=1)
data_cleaned.head()

      Sex   Age     Fare  Pclass  Survived  female  male
0    male  22.0   7.2500       3         0       0     1
1  female  38.0  71.2833       1         1       1     0
2  female  26.0   7.9250       3         1       1     0
3  female  35.0  53.1000       1         1       1     0
4    male  35.0   8.0500       3         0       0     1

In [236]:
X = data_cleaned.drop(["Survived", "Sex"], axis=1)
y = data_cleaned.Survived

In [237]:
X.head()

    Age     Fare  Pclass  female  male
0  22.0   7.2500       3       0     1
1  38.0  71.2833       1       1     0
2  26.0   7.9250       3       1     0
3  35.0  53.1000       1       1     0
4  35.0   8.0500       3       0     1

In [238]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [264]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2)

In [265]:
print(X_train.shape)
print(X_test.shape)
print(y_train.shape)
print(y_test.shape)

(712, 5)
(179, 5)
(712,)
(179,)

In [266]:
from sklearn.naive_bayes import GaussianNB

In [267]:
nbobj = GaussianNB()

In [268]:
nbobj.fit(X_train, y_train)

GaussianNB()

In [269]:
nbobj.score(X_train, y_train)

0.7724719101123596

In [270]:
predicted_y = nbobj.predict(X_test)

In [271]:
from sklearn.metrics import accuracy_score
from sklearn.metrics import balanced_accuracy_score
from sklearn.metrics import confusion_matrix

In [272]:
accuracy_score(y_test, predicted_y)

0.8156424581005587

In [273]:
confusion_matrix(y_test, predicted_y)

array([[98, 11],
       [22, 48]], dtype=int64)

In [275]:
pd.DataFrame({"y_test":y_test, "predicted":predicted_y}).head(10)

     y_test  predicted
330       1          1
463       0          0
780       1          1
631       0          0
10        1          1
247       1          1
200       0          0
659       0          1
406       0          0
450       0          0